In [1]:
# YOUR CODE HERE
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

/Users/will/anaconda3/lib/python3.7/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
# Configure libraries
# The seaborn library makes plots look nicer
sns.set(context = 'talk', style='white')

# Don't display too many rows/cols of DataFrames
pd.options.display.max_rows = 7
pd.options.display.max_columns = 8

# Round decimals when displaying DataFrames
pd.set_option('precision', 2)

# Make plots just slightly bigger for displaying well in notebook
# set plotting size parameter
plt.rcParams['figure.figsize'] = (10, 5)

In [3]:
# read in and clean up the data
survey = pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/steak-survey/steak-risk-survey.csv')
survey  = survey.iloc[1:,2:]
survey.columns = ['smoking','alcohol','gambling',
 'skydiving','speeding', 'cheated',
 'steak', 'steak_preference','gender',
 'age', 'income', 'education', 'region']
survey = survey.dropna(how='all')
survey.head()

,smoking,alcohol,gambling,skydiving,...,age,income,education,region
2,No,Yes,No,No,...,> 60,"$50,000 - $99,999",Some college or Associate degree,East North Central
3,No,Yes,Yes,No,...,> 60,"$150,000+",Graduate degree,South Atlantic
4,Yes,Yes,Yes,No,...,> 60,"$50,000 - $99,999",Bachelor degree,New England
5,No,Yes,No,No,...,> 60,"$50,000 - $99,999",Graduate degree,Middle Atlantic
6,No,No,No,No,...,18-29,"$0 - $24,999",Some college or Associate degree,West South Central

In [13]:
survey.smoking.unique()

array(['No', 'Yes', nan], dtype=object)

In [97]:
a = survey.groupby(['gender','cheated']).size().reset_index()

In [89]:
i = survey.groupby(['gender','cheated']).size().reset_index()['gender']

In [102]:
a = survey.groupby(['gender','cheated']).size().reset_index()

In [103]:
a['count'] = a[0]

In [109]:
a['total'] = a.groupby('gender')['count'].sum()

In [112]:
a

   gender cheated    0  count  total
0  Female      No  224    224    NaN
1  Female     Yes   43     43    NaN
2    Male      No  200    200    NaN
3    Male     Yes   45     45    NaN

In [113]:
totals

   gender    0
0  Female  267
1    Male  245

In [117]:
b = a.merge(totals, how='left', on='gender')
b

   gender cheated  0_x  count  total  0_y
0  Female      No  224    224    NaN  267
1  Female     Yes   43     43    NaN  267
2    Male      No  200    200    NaN  245
3    Male     Yes   45     45    NaN  245

In [118]:
b['prop'] = b['0_x']/b['0_y']

In [119]:
b

   gender cheated  0_x  count  total  0_y  prop
0  Female      No  224    224    NaN  267  0.84
1  Female     Yes   43     43    NaN  267  0.16
2    Male      No  200    200    NaN  245  0.82
3    Male     Yes   45     45    NaN  245  0.18